
#############################################################
#                                                           #
#                           연산                             #
#                                                           #
#############################################################

# Excel에서도 sum이나 +, - 기호로 셀과 셀 단위, 열과 열단위, 행과 행단위 연산이 가능합니다.

# python에서도 엑셀과 마찬가지로 사칙 연산외 다양한 통계 연산 기능을 기본으로 제공해 줍니다.

# (사용법도 물론 매우 쉽습니다^^)

# 사칙연산 (+, -, /, *)
# 더하기 (+)

# 빼기 (-)

# 나누기 (/)

# 곱하기 (*)

# + : 덧셈
a = 10
b = 3

print(a + b)
# [출력]
# 13

# 10 + 234
# [출력]
# 244

# += 기호는 + (덧셈) 한 뒤 자기 자신의 변수에 재 할당합니다.

# (예시) a += 3 은 a = a + 3과 같습니다.

s = 10
s += 5
print(s)
# [출력]


# 15
# - : 뺄셈
a = 10
b = 3

print(a - b)
# [출력]
# 7

# 10 - 9
# [출력]
# 1

s = 10
s -= 3
print(s)
# [출력]
# 7

# / : 나눗셈
a = 10
b = 3

print(a / b)
# [출력]
# 3.3333333333333335


print(10.7 / 7)
# [출력]
# 1.5285714285714285

s = 10
s /= 2
print(s)
# [출력]
# 5.0

# * : 곱셈
a = 10
b = 3

print(a * b)
# [출력]
# 30

print(a * 10)
# [출력]
# 100

s = 20
s *= 3

print(s)
# [출력]
# 60

##########################################################################################################################

# 1) 기타 연산자 (%, //, **)

# //: floor division 연산자입니다. 나눗셈에 대한 몫을 정수형으로 구함

# %: modulus 연산자입니다. 몫을 나눈 나머지를 구함

# **: 제곱 연산

# // : Floor Division
# 나눗셈에 대한 몫을 정수형으로 구함
a = 10
b = 3

# 일반 나눗셈 연산 결과

print(a / b)
# [출력]

# 3.3333333333333335
# // 연산 결과

print(a // b)
# [출력]

# 3
# % : modulus
# 몫을 나눈 나머지를 구합니다.
a = 10
b = 3
print(a % b)
# [출력]


# 1
# ** : 제곱 연산
# 제곱 연산을 수행합니다.
a = 10
b = 3
print(a ** b)
# [출력]
# 1000

print(2 ** 10)
# [출력]
# 1024

# 괄호 ()의 활용
# 수학 연산할 때와 마찬가지로, , /을 먼저 계산하며, 괄호 ()를 활용*하여 먼저 연산할 부분을 지정할 수 있습니다.

print(10 + 2 * 5)
# [출력]
# 20

print((10 + 2) * 5)
# [출력]
# 60

# 다음과 같은 경우는 어떻게 될까요?

a = '10'
b = '20'
print(a + b)

# [출력]
# '1020'
# 연산시 타입(type)이 다르면 Error가 발생합니다.

a = '10'
b = 20
# print(a + b)
# [출력]

# TypeError Traceback (most recent call last) in ----> 1 a + b

# TypeError: must be str, not int

##########################################################################################################################

# 연습문제
# a와 b를 덧셈하여 다음의 결과가 나오도록 코드를 입력해 주세요

# 단, a와 b의 값을 수정하지 않습니다.
# a = '10'
# b = 20
# # 코드를 입력해 주세요
print(int(a) + b)
# [출력]
# 30

# # 코드를 입력해 주세요
print(a + str(b))
# [출력]

# '1020'

from auto_commit import git_auto_push
git_auto_push('operators_conditions')